---
kind: type
id: T:Autodesk.Revit.DB.AdaptiveComponentFamilyUtils
source: html/6fdc0a79-5217-21b2-122d-b1987180cc5b.htm
---
# Autodesk.Revit.DB.AdaptiveComponentFamilyUtils

An interface for Adaptive Component Instances.

## Syntax (C#)
```csharp
public static class AdaptiveComponentFamilyUtils
```